In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'1.0.5'

In [6]:
data_path = 'D:/zbb99/Desktop/Python_DP_Code_Train/Pandas/data/'

# 一、文件读取与写入

## 1. 读取

In [8]:
df = pd.read_csv(data_path + 'table.csv')
df.head()

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M  street_1     173      63  34.0      A+
1    S_1   C_1  1102      F  street_2     192      73  32.5      B+
2    S_1   C_1  1103      M  street_2     186      82  87.2      B+
3    S_1   C_1  1104      F  street_2     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+

In [18]:
# sep可设置不同的分隔符
# header='infer',默认会自动推断数据文件头,如果设置为None则无文件头,为1则第一行是文件
df_txt = pd.read_table(data_path + 'table.txt', sep='\t', header=0)
df_txt

   col1 col2  col3    col4
0     2    a   1.4   apple
1     3    b   3.4  banana
2     6    c   2.5  orange
3     5    d   3.2   lemon

In [20]:
#需要安装xlrd包
df_excel = pd.read_excel(data_path + 'table.xlsx')
df_excel.head()

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M  street_1     173      63  34.0      A+
1    S_1   C_1  1102      F  street_2     192      73  32.5      B+
2    S_1   C_1  1103      M  street_2     186      82  87.2      B+
3    S_1   C_1  1104      F  street_2     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+

## 2. 写入

In [24]:
# 保留行索引和列名, 分别是header和index
df.to_csv(data_path + 'new_table.csv')
df.to_csv(data_path + 'new_table3.csv', index=False)
df.to_csv(data_path + 'new_table4.csv', header=False)

In [28]:
#需要安装openpyxl
df.to_excel(data_path +  'new_table5.xlsx', sheet_name='Sheet1')

# 二、基本数据结构

pandas主要有两种数据结构，一个是Series, 一个是DataFrame

## 1. Series

Series是一个类数组的数据结构, 具有索引(Index).

一种类似于一维数组的对象，由一组数据（各种numpy数据类型）以及一组与之相关的数据标签（即索引）。

**数据+索引**

索引在左边，数据在右边。如果没有为数据指定索引，会制动创建一个0到N-1（N为数据的长度）的整数型索引

### Series具有常见的属性
- Value
- index
- name
- dtype

In [33]:
s = pd.Series(np.random.randn(5),index=['a','b','c','d','e'],name='这是一个Series',dtype='float64')
s

a   -0.500692
b    0.010613
c   -0.910197
d   -0.314131
e    0.103895
Name: 这是一个Series, dtype: float64

访问Series属性

In [41]:
s.name

'这是一个Series'

In [43]:
s.values

array([-0.5006923 ,  0.01061344, -0.91019735, -0.31413097,  0.1038946 ])

In [44]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [46]:
s.dtype

dtype('float64')

In [47]:
s['a']

-0.5006923011578933

In [48]:
s.mean()

-0.32210251595555045

## 2.DataFrame

DataFrame可以看成是由若干Series组合而成，这些Series共享同一index行索引，列索引则包含所有Series的列名称，行索引和列索引均有name属性。

标准的DataFrame结构包含：

①数据内容部分df.values，它是一个numpy的ndarray类型

②行索引df.index，列索引df. columns

③行索引的名字df.index.name，和列索引的名字df.columns.name

In [56]:
df = pd.DataFrame({'col1':list('abcde'),'col2':range(5,10),'col3':([1,3,2,4,67])}, index=list('一二三四五'))
df

  col1  col2  col3
一    a     5     1
二    b     6     3
三    c     7     2
四    d     8     4
五    e     9    67

In [57]:
df['col1']

一    a
二    b
三    c
四    d
五    e
Name: col1, dtype: object

In [58]:
type(df)

pandas.core.frame.DataFrame

In [59]:
type(df['col1'])

pandas.core.series.Series

In [63]:
df = df.rename(index={'一':'one'}, columns={'col1':'new_col1'})
df

    new_col1  col2  col3
one        a     5     1
二          b     6     3
三          c     7     2
四          d     8     4
五          e     9    67

In [64]:
df.index

Index(['one', '二', '三', '四', '五'], dtype='object')

In [65]:
df.columns

Index(['new_col1', 'col2', 'col3'], dtype='object')

In [66]:
df.values

array([['a', 5, 1],
       ['b', 6, 3],
       ['c', 7, 2],
       ['d', 8, 4],
       ['e', 9, 67]], dtype=object)

In [67]:
df.shape

(5, 3)

In [71]:
df.mean()

col2     7.0
col3    15.4
dtype: float64

In [77]:
df1 = pd.DataFrame({'A':[1,2,3]},index=[1,2,3])
df1

   A
1  1
2  2
3  3

In [78]:
df2 = pd.DataFrame({'A':[1,2,3]},index=[3,1,2])
df2

   A
3  1
1  2
2  3

In [79]:
df2 - df1

   A
1  1
2  1
3 -2